In [53]:
%reload_ext sql
print("sql active")

sql active

In [54]:
%sql postgresql://postgres:0000@localhost/postgres
print ("connecté!")

connecté!

In [55]:
%%sql
drop table survivants;
drop table tickets;
drop table titanic;
drop table famille;

 * postgresql://postgres:***@localhost/postgres
Done.
Done.
Done.
Done.

[]

In [56]:
#Creation de la table titanic
#nous avons separer le nom separer le nom et le prenom des survivants pour faciliter les requettes

%%sql
create table titanic(                   
PassengerID integer primary key,        
Survived integer,
Pclass integer,
Name varchar(100),
Surname varchar(100),
Sex varchar(10),
Age varchar(5),
SibSp integer,
Parch integer,
Ticket varchar(50),
Fare float,
Cabin varchar(20),
Embarked varchar(1));

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [57]:
#creation de la table tickets avec comme cle primaires pclass et ticket
%%sql
create table tickets(
Pclass integer,
Ticket varchar(50),
Fare float,
Cabin varchar(50),
Embarked varchar(1)
);

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [58]:
#creation de la table survivants avec comme cle primaires le nom et le prenom
#et avec pclass en cle etrangere
%%sql
create table survivants (
Survived integer ,
Name varchar (100) ,
Surname varchar (100) ,
Sex varchar(10),
Age varchar(5),
Ticket varchar(50));

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [59]:
#creation de la table famille
%%sql
create table famille (
Name varchar (100) ,
Surname varchar (100) ,
SibSp integer,
Parch integer);

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [60]:
%%sql
copy titanic from '/home/oglutao/Desktop/bdd-titanic.csv' delimiter ',' CSV header;

 * postgresql://postgres:***@localhost/postgres
891 rows affected.

[]

In [61]:
test = %sql select * from titanic;

 * postgresql://postgres:***@localhost/postgres
891 rows affected.

In [62]:
dataframe = test.DataFrame()
dataframe

,passengerid,survived,pclass,name,surname,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,Braund,Mr. Owen Harris,male,22,1,0,A/5 21171,7.2500,,S
1,2,1,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen,Miss. Laina,female,26,0,0,STON/O2. 3101282,7.9250,,S
3,4,1,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),female,35,1,0,113803,53.1000,C123,S
4,5,0,3,Allen,Mr. William Henry,male,35,0,0,373450,8.0500,,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,Montvila,Rev. Juozas,male,27,0,0,211536,13.0000,,S
887,888,1,1,Graham,Miss. Margaret Edith,female,19,0,0,112053,30.0000,B42,S
888,889,0,3,Johnston,"Miss. Catherine Helen ""Carrie""",female,,1,2,W./C. 6607,23.4500,,S
889,890,1,1,Behr,Mr. Karl Howell,male,26,0,0,111369,30.0000,C148,C
890,891,0,3,Dooley,Mr. Patrick,male,32,0,0,370376,7.7500,,Q

In [63]:
%%sql
insert into tickets (Pclass,Ticket,Fare,Cabin,Embarked) select Pclass,Ticket,Fare,Cabin,Embarked from titanic;

 * postgresql://postgres:***@localhost/postgres
891 rows affected.

[]

In [64]:
test2 = %sql select * from tickets;

 * postgresql://postgres:***@localhost/postgres
891 rows affected.

In [65]:
dataframe = test2.DataFrame()
dataframe

     pclass            ticket     fare cabin embarked
0         3         A/5 21171   7.2500              S
1         1          PC 17599  71.2833   C85        C
2         3  STON/O2. 3101282   7.9250              S
3         1            113803  53.1000  C123        S
4         3            373450   8.0500              S
..      ...               ...      ...   ...      ...
886       2            211536  13.0000              S
887       1            112053  30.0000   B42        S
888       3        W./C. 6607  23.4500              S
889       1            111369  30.0000  C148        C
890       3            370376   7.7500              Q

[891 rows x 5 columns]

In [66]:
%%sql
insert into survivants(Survived,Name,Surname,Sex,Age,Ticket) select Survived,Name,Surname,Sex,Age,Ticket from titanic;

 * postgresql://postgres:***@localhost/postgres
891 rows affected.

[]

In [67]:
test3 = %sql select * from tickets;

 * postgresql://postgres:***@localhost/postgres
891 rows affected.

In [68]:
dataframe = test3.DataFrame()
dataframe

     pclass            ticket     fare cabin embarked
0         3         A/5 21171   7.2500              S
1         1          PC 17599  71.2833   C85        C
2         3  STON/O2. 3101282   7.9250              S
3         1            113803  53.1000  C123        S
4         3            373450   8.0500              S
..      ...               ...      ...   ...      ...
886       2            211536  13.0000              S
887       1            112053  30.0000   B42        S
888       3        W./C. 6607  23.4500              S
889       1            111369  30.0000  C148        C
890       3            370376   7.7500              Q

[891 rows x 5 columns]

In [69]:
%%sql
insert into famille (Name,Surname,SibSp,Parch ) select  Name,Surname,SibSp,Parch from titanic;

 * postgresql://postgres:***@localhost/postgres
891 rows affected.

[]

In [70]:
test4= %sql select * from famille;

 * postgresql://postgres:***@localhost/postgres
891 rows affected.

In [71]:
dataframe = test4.DataFrame()
dataframe

          name                                      surname  sibsp  parch
0       Braund                              Mr. Owen Harris      1      0
1      Cumings   Mrs. John Bradley (Florence Briggs Thayer)      1      0
2    Heikkinen                                  Miss. Laina      0      0
3     Futrelle           Mrs. Jacques Heath (Lily May Peel)      1      0
4        Allen                            Mr. William Henry      0      0
..         ...                                          ...    ...    ...
886   Montvila                                  Rev. Juozas      0      0
887     Graham                         Miss. Margaret Edith      0      0
888   Johnston               Miss. Catherine Helen "Carrie"      1      2
889       Behr                              Mr. Karl Howell      0      0
890     Dooley                                  Mr. Patrick      0      0

[891 rows x 4 columns]